def додати(x, y):
    return x + y

def відняти(x, y):
    return x - y

def множити(x, y):
    return x * y

def діілити(x, y):
    if y != 0:
        return x / y
    else:
        return "Помилка: ділення на нуль"

print("Виберіть операцію:")
print("1. Сума")
print("2. Віднімання")
print("3. Множення")
print("4. Ділення")

вибір = input("Ваш вибір: ")

число_1 = float(input("Введіть перше число: "))
число_2 = float(input("Введіть друге число: "))

if вибір == '1':
    print(число_1, "+", число_2, "=", додати(число_1, число_2))
elif вибір == '2':
    print(число_1, "-", число_2, "=", відняти(число_1, число_2))
elif вибір == '3':
    print(число_1, "*", число_2, "=", множити(число_1, число_2))
elif вибір == '4':
    print(число_1, "/", число_2, "=", діілити(число_1, число_2))
else:
    print("Невірний вхід")